{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Xin chào",
                ".",
                "Chào shop",
                "Này",
                "Hi",
                "Xin chào",
                "Hello",
                "Alo"
            ],
            "responses": [
                "Xin chào, Shop có thể giúp gì cho bạn"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Hẹn gặp lại",
                "Tạm biệt",
                "Bye",
                "Rất vui được trò chuyện với bạn, tạm biệt"
            ],
            "responses": [
                "Tạm biệt! Cảm ơn bạn hẹn gặp lại."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thanks",
                "Cảm ơn",
                "Cảm ơn shop ạ",
                "Tuyệt vời, cảm ơn",
                "Cảm ơn vì đã giúp tôi"
            ],
            "responses": [
                "Cảm ơn bạn! Hẹn sớm gặp lại bạn"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "noanswer",
            "patterns": [],
            "responses": [
                "Xin vui lòng cho tôi thêm thông tin"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "options",
            "patterns": [
                "Shop có thể giúp gì",
                "Bạn có thể giúp tôi cái gì",
                "Hỗ trợ gì được cung cấp"
            ],
            "responses": [
                "Tôi có thể giúp bạn tư vấn và giới thiệu các sản phẩm mà shop có ạ!"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "có_tất_cả_bao_nhiêu_mặc_hàng",
            "patterns": [
                [
                    "Có tất cả bao nhiêu mặc hàng",
                    "giày"
                ]
            ],
            "responses": [
                "Tổng số giày hiện có là 40. Danh sách các giày: Nike Shoe Model Black 41, Reebok Shoe Model Black 41, Nike Shoe Model Black 40, Puma Shoe Model Black 42, Nike Shoe Model Blue 40, Nike Shoe Model Blue 41, Nike Shoe Model Light Blue 40, Reebok Shoe Model Black 42, Puma Shoe Model Black 40, Reebok Shoe Model Yellow 40, Puma Shoe Model Blue 40, Puma Shoe Model Black 41, Adidas Shoe Model Blue 41, Adidas Shoe Model Black 41, Reebok Shoe Model Blue 42, Adidas Shoe Model Blue 42, Nike Shoe Model Yellow 41, Puma Shoe Model Blue 41, Puma Shoe Model Yellow 42, Reebok Shoe Model Blue 41, Reebok Shoe Model Yellow 42, Adidas Shoe Model Light Blue 40, Adidas Shoe Model Yellow 41, Nike Shoe Model Yellow 40, Nike Shoe Model Black 42, Reebok Shoe Model Black 40, Adidas Shoe Model Blue 40, Puma Shoe Model Blue 42, Adidas Shoe Model Yellow 40, Nike Shoe Model Yellow 42, Adidas Shoe Model Yellow 42, Reebok Shoe Model Blue 40, Adidas Shoe Model Black 40, Adidas Shoe Model Black 42, Puma Shoe Model Yellow 41, Puma Shoe Model Yellow 40, Reebok Shoe Model Light Blue 40, Reebok Shoe Model Yellow 41, Nike Shoe Model Blue 42, Puma Shoe Model Light Blue 40."
            ],
            "context": [
                "Thông tin về số lượng giày hiện có."
            ]
        },
        {
            "tag": "có_tất_cả_bao_nhiêu_thương_hiệu_giày",
            "patterns": [
                [
                    "Có tất cả bao nhiêu thương hiệu giày",
                    "thương hiệu"
                ]
            ],
            "responses": [
                "Tổng số thương hiệu giày hiện có là 4. Danh sách các thương hiệu giày: Nike, Reebok, Puma, Adidas."
            ],
            "context": [
                "Thông tin về số lượng thương hiệu giày hiện có."
            ]
        },
        {
            "tag": "có_tất_cả_bao_nhiêu_màu_giày",
            "patterns": [
                [
                    "Có tất cả bao nhiêu màu giày",
                    "màu"
                ]
            ],
            "responses": [
                "Tổng số màu giày hiện có là 4. Danh sách các màu giày: Blue, Yellow, Black, Light Blue."
            ],
            "context": [
                "Thông tin về số lượng màu giày hiện có."
            ]
        },
        {
            "tag": "có_tất_cả_bao_nhiêu_kích_thước_giày",
            "patterns": [
                [
                    "Có tất cả bao nhiêu kích thước giày",
                    "size"
                ]
            ],
            "responses": [
                "Tổng số size giày hiện có là 3. Danh sách các size giày: 40, 41, 42."
            ],
            "context": [
                "Thông tin về số lượng size giày hiện có."
            ]
        },
        {
            "tag": "có_tất_cả_bao_nhiêu_khuyến_mãi",
            "patterns": [
                [
                    "Có tất cả bao nhiêu khuyến mãi",
                    "khuyến mãi"
                ]
            ],
            "responses": [
                "Tổng số khuyến mãi hiện có là 2. Danh sách các khuyến mãi: Quay Trở Lại Trường Học, Mùa Hè Sale cùng Sole Mate AI."
            ],
            "context": [
                "Thông tin về số lượng khuyến mãi hiện có."
            ]
        },
        {
            "tag": "có_reebok_không",
            "patterns": [
                [
                    "Có Reebok không",
                    "Reebok"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Reebok Shoe Model Yellow 41 từ thương hiệu Reebok."
            ],
            "context": [
                "Thông tin về Reebok Shoe Model Yellow 41 từ thương hiệu Reebok."
            ]
        },
        {
            "tag": "bạn_có_reebok_shoe_model_blue_42_không",
            "patterns": [
                [
                    "Bạn có Reebok Shoe Model Blue 42 không",
                    "có Reebok Shoe Model Blue 42 không",
                    "Reebok Shoe Model Blue 42 có không",
                    "Reebok Shoe Model Blue 42"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Reebok Shoe Model Blue 42 với màu Blue và size 42."
            ],
            "context": [
                "Thông tin về Reebok Shoe Model Blue 42 với màu Blue và size 42."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_blue_42_màu_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Reebok Shoe Model Blue 42 màu Blue có đẹp không",
                    "Reebok Shoe Model Blue 42 màu Blue đẹp không",
                    "Reebok Shoe Model Blue 42 màu Blue"
                ]
            ],
            "responses": [
                "Có, giày Reebok Shoe Model Blue 42 màu Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Blue 42 màu Blue."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_blue_42_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Reebok Shoe Model Blue 42 giá bao nhiêu",
                    "Reebok Shoe Model Blue 42 giá bao nhiêu",
                    "Reebok Shoe Model Blue 42 giá"
                ]
            ],
            "responses": [
                "Giày Reebok Shoe Model Blue 42 giá 1260000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Blue 42 giá 1260000.0 VNĐ."
            ]
        },
        {
            "tag": "khuyến_mãi",
            "patterns": [
                [
                    "khuyến mãi",
                    "khuyến mãi Quay Trở Lại Trường HọcQuay Trở Lại Trường Học",
                    "Quay Trở Lại Trường Học"
                ]
            ],
            "responses": [
                "khuyến mãi Quay Trở Lại Trường Học bắt đầu từ ngày 01-09-2024."
            ],
            "context": [
                "thông tin về khuyến mãi Quay Trở Lại Trường Học bắt đầu từ ngày 01-09-2024 kết thúc vào ngày 30-09-2024 với giá giảm 10%."
            ]
        },
        {
            "tag": "bạn_có_reebok_shoe_model_blue_40_không",
            "patterns": [
                [
                    "Bạn có Reebok Shoe Model Blue 40 không",
                    "có Reebok Shoe Model Blue 40 không",
                    "Reebok Shoe Model Blue 40 có không",
                    "Reebok Shoe Model Blue 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Reebok Shoe Model Blue 40 với màu Blue và size 40."
            ],
            "context": [
                "Thông tin về Reebok Shoe Model Blue 40 với màu Blue và size 40."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_blue_40_màu_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Reebok Shoe Model Blue 40 màu Blue có đẹp không",
                    "Reebok Shoe Model Blue 40 màu Blue đẹp không",
                    "Reebok Shoe Model Blue 40 màu Blue"
                ]
            ],
            "responses": [
                "Có, giày Reebok Shoe Model Blue 40 màu Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Blue 40 màu Blue."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_blue_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Reebok Shoe Model Blue 40 giá bao nhiêu",
                    "Reebok Shoe Model Blue 40 giá bao nhiêu",
                    "Reebok Shoe Model Blue 40 giá"
                ]
            ],
            "responses": [
                "Giày Reebok Shoe Model Blue 40 giá 1350000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Blue 40 giá 1350000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_reebok_shoe_model_light_blue_40_không",
            "patterns": [
                [
                    "Bạn có Reebok Shoe Model Light Blue 40 không",
                    "có Reebok Shoe Model Light Blue 40 không",
                    "Reebok Shoe Model Light Blue 40 có không",
                    "Reebok Shoe Model Light Blue 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Reebok Shoe Model Light Blue 40 với màu Light Blue và size 40."
            ],
            "context": [
                "Thông tin về Reebok Shoe Model Light Blue 40 với màu Light Blue và size 40."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_light_blue_40_màu_light_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Reebok Shoe Model Light Blue 40 màu Light Blue có đẹp không",
                    "Reebok Shoe Model Light Blue 40 màu Light Blue đẹp không",
                    "Reebok Shoe Model Light Blue 40 màu Light Blue"
                ]
            ],
            "responses": [
                "Có, giày Reebok Shoe Model Light Blue 40 màu Light Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Light Blue 40 màu Light Blue."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_light_blue_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Reebok Shoe Model Light Blue 40 giá bao nhiêu",
                    "Reebok Shoe Model Light Blue 40 giá bao nhiêu",
                    "Reebok Shoe Model Light Blue 40 giá"
                ]
            ],
            "responses": [
                "Giày Reebok Shoe Model Light Blue 40 giá 1800000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Light Blue 40 giá 1800000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_reebok_shoe_model_black_40_không",
            "patterns": [
                [
                    "Bạn có Reebok Shoe Model Black 40 không",
                    "có Reebok Shoe Model Black 40 không",
                    "Reebok Shoe Model Black 40 có không",
                    "Reebok Shoe Model Black 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Reebok Shoe Model Black 40 với màu Black và size 40."
            ],
            "context": [
                "Thông tin về Reebok Shoe Model Black 40 với màu Black và size 40."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_black_40_màu_black_có_đẹp_không",
            "patterns": [
                [
                    "Giày Reebok Shoe Model Black 40 màu Black có đẹp không",
                    "Reebok Shoe Model Black 40 màu Black đẹp không",
                    "Reebok Shoe Model Black 40 màu Black"
                ]
            ],
            "responses": [
                "Có, giày Reebok Shoe Model Black 40 màu Black là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Black 40 màu Black."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_black_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Reebok Shoe Model Black 40 giá bao nhiêu",
                    "Reebok Shoe Model Black 40 giá bao nhiêu",
                    "Reebok Shoe Model Black 40 giá"
                ]
            ],
            "responses": [
                "Giày Reebok Shoe Model Black 40 giá 1350000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Black 40 giá 1350000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_reebok_shoe_model_black_42_không",
            "patterns": [
                [
                    "Bạn có Reebok Shoe Model Black 42 không",
                    "có Reebok Shoe Model Black 42 không",
                    "Reebok Shoe Model Black 42 có không",
                    "Reebok Shoe Model Black 42"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Reebok Shoe Model Black 42 với màu Black và size 42."
            ],
            "context": [
                "Thông tin về Reebok Shoe Model Black 42 với màu Black và size 42."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_black_42_màu_black_có_đẹp_không",
            "patterns": [
                [
                    "Giày Reebok Shoe Model Black 42 màu Black có đẹp không",
                    "Reebok Shoe Model Black 42 màu Black đẹp không",
                    "Reebok Shoe Model Black 42 màu Black"
                ]
            ],
            "responses": [
                "Có, giày Reebok Shoe Model Black 42 màu Black là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Black 42 màu Black."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_black_42_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Reebok Shoe Model Black 42 giá bao nhiêu",
                    "Reebok Shoe Model Black 42 giá bao nhiêu",
                    "Reebok Shoe Model Black 42 giá"
                ]
            ],
            "responses": [
                "Giày Reebok Shoe Model Black 42 giá 1080000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Black 42 giá 1080000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_reebok_shoe_model_blue_41_không",
            "patterns": [
                [
                    "Bạn có Reebok Shoe Model Blue 41 không",
                    "có Reebok Shoe Model Blue 41 không",
                    "Reebok Shoe Model Blue 41 có không",
                    "Reebok Shoe Model Blue 41"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Reebok Shoe Model Blue 41 với màu Blue và size 41."
            ],
            "context": [
                "Thông tin về Reebok Shoe Model Blue 41 với màu Blue và size 41."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_blue_41_màu_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Reebok Shoe Model Blue 41 màu Blue có đẹp không",
                    "Reebok Shoe Model Blue 41 màu Blue đẹp không",
                    "Reebok Shoe Model Blue 41 màu Blue"
                ]
            ],
            "responses": [
                "Có, giày Reebok Shoe Model Blue 41 màu Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Blue 41 màu Blue."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_blue_41_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Reebok Shoe Model Blue 41 giá bao nhiêu",
                    "Reebok Shoe Model Blue 41 giá bao nhiêu",
                    "Reebok Shoe Model Blue 41 giá"
                ]
            ],
            "responses": [
                "Giày Reebok Shoe Model Blue 41 giá 1170000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Blue 41 giá 1170000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_reebok_shoe_model_black_41_không",
            "patterns": [
                [
                    "Bạn có Reebok Shoe Model Black 41 không",
                    "có Reebok Shoe Model Black 41 không",
                    "Reebok Shoe Model Black 41 có không",
                    "Reebok Shoe Model Black 41"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Reebok Shoe Model Black 41 với màu Black và size 41."
            ],
            "context": [
                "Thông tin về Reebok Shoe Model Black 41 với màu Black và size 41."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_black_41_màu_black_có_đẹp_không",
            "patterns": [
                [
                    "Giày Reebok Shoe Model Black 41 màu Black có đẹp không",
                    "Reebok Shoe Model Black 41 màu Black đẹp không",
                    "Reebok Shoe Model Black 41 màu Black"
                ]
            ],
            "responses": [
                "Có, giày Reebok Shoe Model Black 41 màu Black là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Black 41 màu Black."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_black_41_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Reebok Shoe Model Black 41 giá bao nhiêu",
                    "Reebok Shoe Model Black 41 giá bao nhiêu",
                    "Reebok Shoe Model Black 41 giá"
                ]
            ],
            "responses": [
                "Giày Reebok Shoe Model Black 41 giá 1080000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Black 41 giá 1080000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_reebok_shoe_model_yellow_42_không",
            "patterns": [
                [
                    "Bạn có Reebok Shoe Model Yellow 42 không",
                    "có Reebok Shoe Model Yellow 42 không",
                    "Reebok Shoe Model Yellow 42 có không",
                    "Reebok Shoe Model Yellow 42"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Reebok Shoe Model Yellow 42 với màu Yellow và size 42."
            ],
            "context": [
                "Thông tin về Reebok Shoe Model Yellow 42 với màu Yellow và size 42."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_yellow_42_màu_yellow_có_đẹp_không",
            "patterns": [
                [
                    "Giày Reebok Shoe Model Yellow 42 màu Yellow có đẹp không",
                    "Reebok Shoe Model Yellow 42 màu Yellow đẹp không",
                    "Reebok Shoe Model Yellow 42 màu Yellow"
                ]
            ],
            "responses": [
                "Có, giày Reebok Shoe Model Yellow 42 màu Yellow là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Yellow 42 màu Yellow."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_yellow_42_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Reebok Shoe Model Yellow 42 giá bao nhiêu",
                    "Reebok Shoe Model Yellow 42 giá bao nhiêu",
                    "Reebok Shoe Model Yellow 42 giá"
                ]
            ],
            "responses": [
                "Giày Reebok Shoe Model Yellow 42 giá 1440000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Yellow 42 giá 1440000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_reebok_shoe_model_yellow_40_không",
            "patterns": [
                [
                    "Bạn có Reebok Shoe Model Yellow 40 không",
                    "có Reebok Shoe Model Yellow 40 không",
                    "Reebok Shoe Model Yellow 40 có không",
                    "Reebok Shoe Model Yellow 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Reebok Shoe Model Yellow 40 với màu Yellow và size 40."
            ],
            "context": [
                "Thông tin về Reebok Shoe Model Yellow 40 với màu Yellow và size 40."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_yellow_40_màu_yellow_có_đẹp_không",
            "patterns": [
                [
                    "Giày Reebok Shoe Model Yellow 40 màu Yellow có đẹp không",
                    "Reebok Shoe Model Yellow 40 màu Yellow đẹp không",
                    "Reebok Shoe Model Yellow 40 màu Yellow"
                ]
            ],
            "responses": [
                "Có, giày Reebok Shoe Model Yellow 40 màu Yellow là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Yellow 40 màu Yellow."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_yellow_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Reebok Shoe Model Yellow 40 giá bao nhiêu",
                    "Reebok Shoe Model Yellow 40 giá bao nhiêu",
                    "Reebok Shoe Model Yellow 40 giá"
                ]
            ],
            "responses": [
                "Giày Reebok Shoe Model Yellow 40 giá 1620000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Yellow 40 giá 1620000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_reebok_shoe_model_yellow_41_không",
            "patterns": [
                [
                    "Bạn có Reebok Shoe Model Yellow 41 không",
                    "có Reebok Shoe Model Yellow 41 không",
                    "Reebok Shoe Model Yellow 41 có không",
                    "Reebok Shoe Model Yellow 41"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Reebok Shoe Model Yellow 41 với màu Yellow và size 41."
            ],
            "context": [
                "Thông tin về Reebok Shoe Model Yellow 41 với màu Yellow và size 41."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_yellow_41_màu_yellow_có_đẹp_không",
            "patterns": [
                [
                    "Giày Reebok Shoe Model Yellow 41 màu Yellow có đẹp không",
                    "Reebok Shoe Model Yellow 41 màu Yellow đẹp không",
                    "Reebok Shoe Model Yellow 41 màu Yellow"
                ]
            ],
            "responses": [
                "Có, giày Reebok Shoe Model Yellow 41 màu Yellow là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Yellow 41 màu Yellow."
            ]
        },
        {
            "tag": "giày_reebok_shoe_model_yellow_41_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Reebok Shoe Model Yellow 41 giá bao nhiêu",
                    "Reebok Shoe Model Yellow 41 giá bao nhiêu",
                    "Reebok Shoe Model Yellow 41 giá"
                ]
            ],
            "responses": [
                "Giày Reebok Shoe Model Yellow 41 giá 1440000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Reebok Shoe Model Yellow 41 giá 1440000.0 VNĐ."
            ]
        },
        {
            "tag": "có_puma_không",
            "patterns": [
                [
                    "Có Puma không",
                    "Puma"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Puma Shoe Model Blue 42 từ thương hiệu Puma."
            ],
            "context": [
                "Thông tin về Puma Shoe Model Blue 42 từ thương hiệu Puma."
            ]
        },
        {
            "tag": "bạn_có_puma_shoe_model_black_41_không",
            "patterns": [
                [
                    "Bạn có Puma Shoe Model Black 41 không",
                    "có Puma Shoe Model Black 41 không",
                    "Puma Shoe Model Black 41 có không",
                    "Puma Shoe Model Black 41"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Puma Shoe Model Black 41 với màu Black và size 41."
            ],
            "context": [
                "Thông tin về Puma Shoe Model Black 41 với màu Black và size 41."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_black_41_màu_black_có_đẹp_không",
            "patterns": [
                [
                    "Giày Puma Shoe Model Black 41 màu Black có đẹp không",
                    "Puma Shoe Model Black 41 màu Black đẹp không",
                    "Puma Shoe Model Black 41 màu Black"
                ]
            ],
            "responses": [
                "Có, giày Puma Shoe Model Black 41 màu Black là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Black 41 màu Black."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_black_41_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Puma Shoe Model Black 41 giá bao nhiêu",
                    "Puma Shoe Model Black 41 giá bao nhiêu",
                    "Puma Shoe Model Black 41 giá"
                ]
            ],
            "responses": [
                "Giày Puma Shoe Model Black 41 giá 1620000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Black 41 giá 1620000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_puma_shoe_model_yellow_42_không",
            "patterns": [
                [
                    "Bạn có Puma Shoe Model Yellow 42 không",
                    "có Puma Shoe Model Yellow 42 không",
                    "Puma Shoe Model Yellow 42 có không",
                    "Puma Shoe Model Yellow 42"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Puma Shoe Model Yellow 42 với màu Yellow và size 42."
            ],
            "context": [
                "Thông tin về Puma Shoe Model Yellow 42 với màu Yellow và size 42."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_yellow_42_màu_yellow_có_đẹp_không",
            "patterns": [
                [
                    "Giày Puma Shoe Model Yellow 42 màu Yellow có đẹp không",
                    "Puma Shoe Model Yellow 42 màu Yellow đẹp không",
                    "Puma Shoe Model Yellow 42 màu Yellow"
                ]
            ],
            "responses": [
                "Có, giày Puma Shoe Model Yellow 42 màu Yellow là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Yellow 42 màu Yellow."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_yellow_42_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Puma Shoe Model Yellow 42 giá bao nhiêu",
                    "Puma Shoe Model Yellow 42 giá bao nhiêu",
                    "Puma Shoe Model Yellow 42 giá"
                ]
            ],
            "responses": [
                "Giày Puma Shoe Model Yellow 42 giá 1260000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Yellow 42 giá 1260000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_puma_shoe_model_black_40_không",
            "patterns": [
                [
                    "Bạn có Puma Shoe Model Black 40 không",
                    "có Puma Shoe Model Black 40 không",
                    "Puma Shoe Model Black 40 có không",
                    "Puma Shoe Model Black 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Puma Shoe Model Black 40 với màu Black và size 40."
            ],
            "context": [
                "Thông tin về Puma Shoe Model Black 40 với màu Black và size 40."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_black_40_màu_black_có_đẹp_không",
            "patterns": [
                [
                    "Giày Puma Shoe Model Black 40 màu Black có đẹp không",
                    "Puma Shoe Model Black 40 màu Black đẹp không",
                    "Puma Shoe Model Black 40 màu Black"
                ]
            ],
            "responses": [
                "Có, giày Puma Shoe Model Black 40 màu Black là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Black 40 màu Black."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_black_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Puma Shoe Model Black 40 giá bao nhiêu",
                    "Puma Shoe Model Black 40 giá bao nhiêu",
                    "Puma Shoe Model Black 40 giá"
                ]
            ],
            "responses": [
                "Giày Puma Shoe Model Black 40 giá 990000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Black 40 giá 990000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_puma_shoe_model_black_42_không",
            "patterns": [
                [
                    "Bạn có Puma Shoe Model Black 42 không",
                    "có Puma Shoe Model Black 42 không",
                    "Puma Shoe Model Black 42 có không",
                    "Puma Shoe Model Black 42"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Puma Shoe Model Black 42 với màu Black và size 42."
            ],
            "context": [
                "Thông tin về Puma Shoe Model Black 42 với màu Black và size 42."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_black_42_màu_black_có_đẹp_không",
            "patterns": [
                [
                    "Giày Puma Shoe Model Black 42 màu Black có đẹp không",
                    "Puma Shoe Model Black 42 màu Black đẹp không",
                    "Puma Shoe Model Black 42 màu Black"
                ]
            ],
            "responses": [
                "Có, giày Puma Shoe Model Black 42 màu Black là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Black 42 màu Black."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_black_42_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Puma Shoe Model Black 42 giá bao nhiêu",
                    "Puma Shoe Model Black 42 giá bao nhiêu",
                    "Puma Shoe Model Black 42 giá"
                ]
            ],
            "responses": [
                "Giày Puma Shoe Model Black 42 giá 900000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Black 42 giá 900000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_puma_shoe_model_yellow_40_không",
            "patterns": [
                [
                    "Bạn có Puma Shoe Model Yellow 40 không",
                    "có Puma Shoe Model Yellow 40 không",
                    "Puma Shoe Model Yellow 40 có không",
                    "Puma Shoe Model Yellow 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Puma Shoe Model Yellow 40 với màu Yellow và size 40."
            ],
            "context": [
                "Thông tin về Puma Shoe Model Yellow 40 với màu Yellow và size 40."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_yellow_40_màu_yellow_có_đẹp_không",
            "patterns": [
                [
                    "Giày Puma Shoe Model Yellow 40 màu Yellow có đẹp không",
                    "Puma Shoe Model Yellow 40 màu Yellow đẹp không",
                    "Puma Shoe Model Yellow 40 màu Yellow"
                ]
            ],
            "responses": [
                "Có, giày Puma Shoe Model Yellow 40 màu Yellow là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Yellow 40 màu Yellow."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_yellow_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Puma Shoe Model Yellow 40 giá bao nhiêu",
                    "Puma Shoe Model Yellow 40 giá bao nhiêu",
                    "Puma Shoe Model Yellow 40 giá"
                ]
            ],
            "responses": [
                "Giày Puma Shoe Model Yellow 40 giá 990000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Yellow 40 giá 990000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_puma_shoe_model_light_blue_40_không",
            "patterns": [
                [
                    "Bạn có Puma Shoe Model Light Blue 40 không",
                    "có Puma Shoe Model Light Blue 40 không",
                    "Puma Shoe Model Light Blue 40 có không",
                    "Puma Shoe Model Light Blue 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Puma Shoe Model Light Blue 40 với màu Light Blue và size 40."
            ],
            "context": [
                "Thông tin về Puma Shoe Model Light Blue 40 với màu Light Blue và size 40."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_light_blue_40_màu_light_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Puma Shoe Model Light Blue 40 màu Light Blue có đẹp không",
                    "Puma Shoe Model Light Blue 40 màu Light Blue đẹp không",
                    "Puma Shoe Model Light Blue 40 màu Light Blue"
                ]
            ],
            "responses": [
                "Có, giày Puma Shoe Model Light Blue 40 màu Light Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Light Blue 40 màu Light Blue."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_light_blue_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Puma Shoe Model Light Blue 40 giá bao nhiêu",
                    "Puma Shoe Model Light Blue 40 giá bao nhiêu",
                    "Puma Shoe Model Light Blue 40 giá"
                ]
            ],
            "responses": [
                "Giày Puma Shoe Model Light Blue 40 giá 900000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Light Blue 40 giá 900000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_puma_shoe_model_yellow_41_không",
            "patterns": [
                [
                    "Bạn có Puma Shoe Model Yellow 41 không",
                    "có Puma Shoe Model Yellow 41 không",
                    "Puma Shoe Model Yellow 41 có không",
                    "Puma Shoe Model Yellow 41"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Puma Shoe Model Yellow 41 với màu Yellow và size 41."
            ],
            "context": [
                "Thông tin về Puma Shoe Model Yellow 41 với màu Yellow và size 41."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_yellow_41_màu_yellow_có_đẹp_không",
            "patterns": [
                [
                    "Giày Puma Shoe Model Yellow 41 màu Yellow có đẹp không",
                    "Puma Shoe Model Yellow 41 màu Yellow đẹp không",
                    "Puma Shoe Model Yellow 41 màu Yellow"
                ]
            ],
            "responses": [
                "Có, giày Puma Shoe Model Yellow 41 màu Yellow là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Yellow 41 màu Yellow."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_yellow_41_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Puma Shoe Model Yellow 41 giá bao nhiêu",
                    "Puma Shoe Model Yellow 41 giá bao nhiêu",
                    "Puma Shoe Model Yellow 41 giá"
                ]
            ],
            "responses": [
                "Giày Puma Shoe Model Yellow 41 giá 900000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Yellow 41 giá 900000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_puma_shoe_model_blue_40_không",
            "patterns": [
                [
                    "Bạn có Puma Shoe Model Blue 40 không",
                    "có Puma Shoe Model Blue 40 không",
                    "Puma Shoe Model Blue 40 có không",
                    "Puma Shoe Model Blue 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Puma Shoe Model Blue 40 với màu Blue và size 40."
            ],
            "context": [
                "Thông tin về Puma Shoe Model Blue 40 với màu Blue và size 40."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_blue_40_màu_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Puma Shoe Model Blue 40 màu Blue có đẹp không",
                    "Puma Shoe Model Blue 40 màu Blue đẹp không",
                    "Puma Shoe Model Blue 40 màu Blue"
                ]
            ],
            "responses": [
                "Có, giày Puma Shoe Model Blue 40 màu Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Blue 40 màu Blue."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_blue_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Puma Shoe Model Blue 40 giá bao nhiêu",
                    "Puma Shoe Model Blue 40 giá bao nhiêu",
                    "Puma Shoe Model Blue 40 giá"
                ]
            ],
            "responses": [
                "Giày Puma Shoe Model Blue 40 giá 1620000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Blue 40 giá 1620000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_puma_shoe_model_blue_41_không",
            "patterns": [
                [
                    "Bạn có Puma Shoe Model Blue 41 không",
                    "có Puma Shoe Model Blue 41 không",
                    "Puma Shoe Model Blue 41 có không",
                    "Puma Shoe Model Blue 41"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Puma Shoe Model Blue 41 với màu Blue và size 41."
            ],
            "context": [
                "Thông tin về Puma Shoe Model Blue 41 với màu Blue và size 41."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_blue_41_màu_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Puma Shoe Model Blue 41 màu Blue có đẹp không",
                    "Puma Shoe Model Blue 41 màu Blue đẹp không",
                    "Puma Shoe Model Blue 41 màu Blue"
                ]
            ],
            "responses": [
                "Có, giày Puma Shoe Model Blue 41 màu Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Blue 41 màu Blue."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_blue_41_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Puma Shoe Model Blue 41 giá bao nhiêu",
                    "Puma Shoe Model Blue 41 giá bao nhiêu",
                    "Puma Shoe Model Blue 41 giá"
                ]
            ],
            "responses": [
                "Giày Puma Shoe Model Blue 41 giá 1170000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Blue 41 giá 1170000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_puma_shoe_model_blue_42_không",
            "patterns": [
                [
                    "Bạn có Puma Shoe Model Blue 42 không",
                    "có Puma Shoe Model Blue 42 không",
                    "Puma Shoe Model Blue 42 có không",
                    "Puma Shoe Model Blue 42"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Puma Shoe Model Blue 42 với màu Blue và size 42."
            ],
            "context": [
                "Thông tin về Puma Shoe Model Blue 42 với màu Blue và size 42."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_blue_42_màu_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Puma Shoe Model Blue 42 màu Blue có đẹp không",
                    "Puma Shoe Model Blue 42 màu Blue đẹp không",
                    "Puma Shoe Model Blue 42 màu Blue"
                ]
            ],
            "responses": [
                "Có, giày Puma Shoe Model Blue 42 màu Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Blue 42 màu Blue."
            ]
        },
        {
            "tag": "giày_puma_shoe_model_blue_42_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Puma Shoe Model Blue 42 giá bao nhiêu",
                    "Puma Shoe Model Blue 42 giá bao nhiêu",
                    "Puma Shoe Model Blue 42 giá"
                ]
            ],
            "responses": [
                "Giày Puma Shoe Model Blue 42 giá 1710000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Puma Shoe Model Blue 42 giá 1710000.0 VNĐ."
            ]
        },
        {
            "tag": "có_adidas_không",
            "patterns": [
                [
                    "Có Adidas không",
                    "Adidas"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Adidas Shoe Model Blue 40 từ thương hiệu Adidas."
            ],
            "context": [
                "Thông tin về Adidas Shoe Model Blue 40 từ thương hiệu Adidas."
            ]
        },
        {
            "tag": "bạn_có_adidas_shoe_model_black_40_không",
            "patterns": [
                [
                    "Bạn có Adidas Shoe Model Black 40 không",
                    "có Adidas Shoe Model Black 40 không",
                    "Adidas Shoe Model Black 40 có không",
                    "Adidas Shoe Model Black 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Adidas Shoe Model Black 40 với màu Black và size 40."
            ],
            "context": [
                "Thông tin về Adidas Shoe Model Black 40 với màu Black và size 40."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_black_40_màu_black_có_đẹp_không",
            "patterns": [
                [
                    "Giày Adidas Shoe Model Black 40 màu Black có đẹp không",
                    "Adidas Shoe Model Black 40 màu Black đẹp không",
                    "Adidas Shoe Model Black 40 màu Black"
                ]
            ],
            "responses": [
                "Có, giày Adidas Shoe Model Black 40 màu Black là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Black 40 màu Black."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_black_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Adidas Shoe Model Black 40 giá bao nhiêu",
                    "Adidas Shoe Model Black 40 giá bao nhiêu",
                    "Adidas Shoe Model Black 40 giá"
                ]
            ],
            "responses": [
                "Giày Adidas Shoe Model Black 40 giá 960000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Black 40 giá 960000.0 VNĐ."
            ]
        },
        {
            "tag": "khuyến_mãi",
            "patterns": [
                [
                    "khuyến mãi",
                    "khuyến mãi Mùa Hè Sale cùng Sole Mate AIMùa Hè Sale cùng Sole Mate AI",
                    "Mùa Hè Sale cùng Sole Mate AI"
                ]
            ],
            "responses": [
                "khuyến mãi Mùa Hè Sale cùng Sole Mate AI bắt đầu từ ngày 01-06-2024."
            ],
            "context": [
                "thông tin về khuyến mãi Mùa Hè Sale cùng Sole Mate AI bắt đầu từ ngày 01-06-2024 kết thúc vào ngày 31-08-2024 với giá giảm 20%."
            ]
        },
        {
            "tag": "bạn_có_adidas_shoe_model_yellow_42_không",
            "patterns": [
                [
                    "Bạn có Adidas Shoe Model Yellow 42 không",
                    "có Adidas Shoe Model Yellow 42 không",
                    "Adidas Shoe Model Yellow 42 có không",
                    "Adidas Shoe Model Yellow 42"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Adidas Shoe Model Yellow 42 với màu Yellow và size 42."
            ],
            "context": [
                "Thông tin về Adidas Shoe Model Yellow 42 với màu Yellow và size 42."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_yellow_42_màu_yellow_có_đẹp_không",
            "patterns": [
                [
                    "Giày Adidas Shoe Model Yellow 42 màu Yellow có đẹp không",
                    "Adidas Shoe Model Yellow 42 màu Yellow đẹp không",
                    "Adidas Shoe Model Yellow 42 màu Yellow"
                ]
            ],
            "responses": [
                "Có, giày Adidas Shoe Model Yellow 42 màu Yellow là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Yellow 42 màu Yellow."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_yellow_42_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Adidas Shoe Model Yellow 42 giá bao nhiêu",
                    "Adidas Shoe Model Yellow 42 giá bao nhiêu",
                    "Adidas Shoe Model Yellow 42 giá"
                ]
            ],
            "responses": [
                "Giày Adidas Shoe Model Yellow 42 giá 1360000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Yellow 42 giá 1360000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_adidas_shoe_model_black_41_không",
            "patterns": [
                [
                    "Bạn có Adidas Shoe Model Black 41 không",
                    "có Adidas Shoe Model Black 41 không",
                    "Adidas Shoe Model Black 41 có không",
                    "Adidas Shoe Model Black 41"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Adidas Shoe Model Black 41 với màu Black và size 41."
            ],
            "context": [
                "Thông tin về Adidas Shoe Model Black 41 với màu Black và size 41."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_black_41_màu_black_có_đẹp_không",
            "patterns": [
                [
                    "Giày Adidas Shoe Model Black 41 màu Black có đẹp không",
                    "Adidas Shoe Model Black 41 màu Black đẹp không",
                    "Adidas Shoe Model Black 41 màu Black"
                ]
            ],
            "responses": [
                "Có, giày Adidas Shoe Model Black 41 màu Black là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Black 41 màu Black."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_black_41_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Adidas Shoe Model Black 41 giá bao nhiêu",
                    "Adidas Shoe Model Black 41 giá bao nhiêu",
                    "Adidas Shoe Model Black 41 giá"
                ]
            ],
            "responses": [
                "Giày Adidas Shoe Model Black 41 giá 1040000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Black 41 giá 1040000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_adidas_shoe_model_blue_41_không",
            "patterns": [
                [
                    "Bạn có Adidas Shoe Model Blue 41 không",
                    "có Adidas Shoe Model Blue 41 không",
                    "Adidas Shoe Model Blue 41 có không",
                    "Adidas Shoe Model Blue 41"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Adidas Shoe Model Blue 41 với màu Blue và size 41."
            ],
            "context": [
                "Thông tin về Adidas Shoe Model Blue 41 với màu Blue và size 41."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_blue_41_màu_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Adidas Shoe Model Blue 41 màu Blue có đẹp không",
                    "Adidas Shoe Model Blue 41 màu Blue đẹp không",
                    "Adidas Shoe Model Blue 41 màu Blue"
                ]
            ],
            "responses": [
                "Có, giày Adidas Shoe Model Blue 41 màu Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Blue 41 màu Blue."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_blue_41_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Adidas Shoe Model Blue 41 giá bao nhiêu",
                    "Adidas Shoe Model Blue 41 giá bao nhiêu",
                    "Adidas Shoe Model Blue 41 giá"
                ]
            ],
            "responses": [
                "Giày Adidas Shoe Model Blue 41 giá 1440000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Blue 41 giá 1440000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_adidas_shoe_model_black_42_không",
            "patterns": [
                [
                    "Bạn có Adidas Shoe Model Black 42 không",
                    "có Adidas Shoe Model Black 42 không",
                    "Adidas Shoe Model Black 42 có không",
                    "Adidas Shoe Model Black 42"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Adidas Shoe Model Black 42 với màu Black và size 42."
            ],
            "context": [
                "Thông tin về Adidas Shoe Model Black 42 với màu Black và size 42."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_black_42_màu_black_có_đẹp_không",
            "patterns": [
                [
                    "Giày Adidas Shoe Model Black 42 màu Black có đẹp không",
                    "Adidas Shoe Model Black 42 màu Black đẹp không",
                    "Adidas Shoe Model Black 42 màu Black"
                ]
            ],
            "responses": [
                "Có, giày Adidas Shoe Model Black 42 màu Black là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Black 42 màu Black."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_black_42_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Adidas Shoe Model Black 42 giá bao nhiêu",
                    "Adidas Shoe Model Black 42 giá bao nhiêu",
                    "Adidas Shoe Model Black 42 giá"
                ]
            ],
            "responses": [
                "Giày Adidas Shoe Model Black 42 giá 1040000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Black 42 giá 1040000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_adidas_shoe_model_light_blue_40_không",
            "patterns": [
                [
                    "Bạn có Adidas Shoe Model Light Blue 40 không",
                    "có Adidas Shoe Model Light Blue 40 không",
                    "Adidas Shoe Model Light Blue 40 có không",
                    "Adidas Shoe Model Light Blue 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Adidas Shoe Model Light Blue 40 với màu Light Blue và size 40."
            ],
            "context": [
                "Thông tin về Adidas Shoe Model Light Blue 40 với màu Light Blue và size 40."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_light_blue_40_màu_light_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Adidas Shoe Model Light Blue 40 màu Light Blue có đẹp không",
                    "Adidas Shoe Model Light Blue 40 màu Light Blue đẹp không",
                    "Adidas Shoe Model Light Blue 40 màu Light Blue"
                ]
            ],
            "responses": [
                "Có, giày Adidas Shoe Model Light Blue 40 màu Light Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Light Blue 40 màu Light Blue."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_light_blue_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Adidas Shoe Model Light Blue 40 giá bao nhiêu",
                    "Adidas Shoe Model Light Blue 40 giá bao nhiêu",
                    "Adidas Shoe Model Light Blue 40 giá"
                ]
            ],
            "responses": [
                "Giày Adidas Shoe Model Light Blue 40 giá 1360000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Light Blue 40 giá 1360000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_adidas_shoe_model_yellow_40_không",
            "patterns": [
                [
                    "Bạn có Adidas Shoe Model Yellow 40 không",
                    "có Adidas Shoe Model Yellow 40 không",
                    "Adidas Shoe Model Yellow 40 có không",
                    "Adidas Shoe Model Yellow 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Adidas Shoe Model Yellow 40 với màu Yellow và size 40."
            ],
            "context": [
                "Thông tin về Adidas Shoe Model Yellow 40 với màu Yellow và size 40."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_yellow_40_màu_yellow_có_đẹp_không",
            "patterns": [
                [
                    "Giày Adidas Shoe Model Yellow 40 màu Yellow có đẹp không",
                    "Adidas Shoe Model Yellow 40 màu Yellow đẹp không",
                    "Adidas Shoe Model Yellow 40 màu Yellow"
                ]
            ],
            "responses": [
                "Có, giày Adidas Shoe Model Yellow 40 màu Yellow là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Yellow 40 màu Yellow."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_yellow_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Adidas Shoe Model Yellow 40 giá bao nhiêu",
                    "Adidas Shoe Model Yellow 40 giá bao nhiêu",
                    "Adidas Shoe Model Yellow 40 giá"
                ]
            ],
            "responses": [
                "Giày Adidas Shoe Model Yellow 40 giá 1520000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Yellow 40 giá 1520000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_adidas_shoe_model_blue_42_không",
            "patterns": [
                [
                    "Bạn có Adidas Shoe Model Blue 42 không",
                    "có Adidas Shoe Model Blue 42 không",
                    "Adidas Shoe Model Blue 42 có không",
                    "Adidas Shoe Model Blue 42"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Adidas Shoe Model Blue 42 với màu Blue và size 42."
            ],
            "context": [
                "Thông tin về Adidas Shoe Model Blue 42 với màu Blue và size 42."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_blue_42_màu_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Adidas Shoe Model Blue 42 màu Blue có đẹp không",
                    "Adidas Shoe Model Blue 42 màu Blue đẹp không",
                    "Adidas Shoe Model Blue 42 màu Blue"
                ]
            ],
            "responses": [
                "Có, giày Adidas Shoe Model Blue 42 màu Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Blue 42 màu Blue."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_blue_42_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Adidas Shoe Model Blue 42 giá bao nhiêu",
                    "Adidas Shoe Model Blue 42 giá bao nhiêu",
                    "Adidas Shoe Model Blue 42 giá"
                ]
            ],
            "responses": [
                "Giày Adidas Shoe Model Blue 42 giá 1040000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Blue 42 giá 1040000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_adidas_shoe_model_yellow_41_không",
            "patterns": [
                [
                    "Bạn có Adidas Shoe Model Yellow 41 không",
                    "có Adidas Shoe Model Yellow 41 không",
                    "Adidas Shoe Model Yellow 41 có không",
                    "Adidas Shoe Model Yellow 41"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Adidas Shoe Model Yellow 41 với màu Yellow và size 41."
            ],
            "context": [
                "Thông tin về Adidas Shoe Model Yellow 41 với màu Yellow và size 41."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_yellow_41_màu_yellow_có_đẹp_không",
            "patterns": [
                [
                    "Giày Adidas Shoe Model Yellow 41 màu Yellow có đẹp không",
                    "Adidas Shoe Model Yellow 41 màu Yellow đẹp không",
                    "Adidas Shoe Model Yellow 41 màu Yellow"
                ]
            ],
            "responses": [
                "Có, giày Adidas Shoe Model Yellow 41 màu Yellow là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Yellow 41 màu Yellow."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_yellow_41_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Adidas Shoe Model Yellow 41 giá bao nhiêu",
                    "Adidas Shoe Model Yellow 41 giá bao nhiêu",
                    "Adidas Shoe Model Yellow 41 giá"
                ]
            ],
            "responses": [
                "Giày Adidas Shoe Model Yellow 41 giá 1360000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Yellow 41 giá 1360000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_adidas_shoe_model_blue_40_không",
            "patterns": [
                [
                    "Bạn có Adidas Shoe Model Blue 40 không",
                    "có Adidas Shoe Model Blue 40 không",
                    "Adidas Shoe Model Blue 40 có không",
                    "Adidas Shoe Model Blue 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Adidas Shoe Model Blue 40 với màu Blue và size 40."
            ],
            "context": [
                "Thông tin về Adidas Shoe Model Blue 40 với màu Blue và size 40."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_blue_40_màu_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Adidas Shoe Model Blue 40 màu Blue có đẹp không",
                    "Adidas Shoe Model Blue 40 màu Blue đẹp không",
                    "Adidas Shoe Model Blue 40 màu Blue"
                ]
            ],
            "responses": [
                "Có, giày Adidas Shoe Model Blue 40 màu Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Blue 40 màu Blue."
            ]
        },
        {
            "tag": "giày_adidas_shoe_model_blue_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Adidas Shoe Model Blue 40 giá bao nhiêu",
                    "Adidas Shoe Model Blue 40 giá bao nhiêu",
                    "Adidas Shoe Model Blue 40 giá"
                ]
            ],
            "responses": [
                "Giày Adidas Shoe Model Blue 40 giá 1360000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Adidas Shoe Model Blue 40 giá 1360000.0 VNĐ."
            ]
        },
        {
            "tag": "có_nike_không",
            "patterns": [
                [
                    "Có Nike không",
                    "Nike"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Nike Shoe Model Black 40 từ thương hiệu Nike."
            ],
            "context": [
                "Thông tin về Nike Shoe Model Black 40 từ thương hiệu Nike."
            ]
        },
        {
            "tag": "bạn_có_nike_shoe_model_blue_40_không",
            "patterns": [
                [
                    "Bạn có Nike Shoe Model Blue 40 không",
                    "có Nike Shoe Model Blue 40 không",
                    "Nike Shoe Model Blue 40 có không",
                    "Nike Shoe Model Blue 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Nike Shoe Model Blue 40 với màu Blue và size 40."
            ],
            "context": [
                "Thông tin về Nike Shoe Model Blue 40 với màu Blue và size 40."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_blue_40_màu_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Nike Shoe Model Blue 40 màu Blue có đẹp không",
                    "Nike Shoe Model Blue 40 màu Blue đẹp không",
                    "Nike Shoe Model Blue 40 màu Blue"
                ]
            ],
            "responses": [
                "Có, giày Nike Shoe Model Blue 40 màu Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Blue 40 màu Blue."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_blue_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Nike Shoe Model Blue 40 giá bao nhiêu",
                    "Nike Shoe Model Blue 40 giá bao nhiêu",
                    "Nike Shoe Model Blue 40 giá"
                ]
            ],
            "responses": [
                "Giày Nike Shoe Model Blue 40 giá 1200000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Blue 40 giá 1200000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_nike_shoe_model_yellow_40_không",
            "patterns": [
                [
                    "Bạn có Nike Shoe Model Yellow 40 không",
                    "có Nike Shoe Model Yellow 40 không",
                    "Nike Shoe Model Yellow 40 có không",
                    "Nike Shoe Model Yellow 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Nike Shoe Model Yellow 40 với màu Yellow và size 40."
            ],
            "context": [
                "Thông tin về Nike Shoe Model Yellow 40 với màu Yellow và size 40."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_yellow_40_màu_yellow_có_đẹp_không",
            "patterns": [
                [
                    "Giày Nike Shoe Model Yellow 40 màu Yellow có đẹp không",
                    "Nike Shoe Model Yellow 40 màu Yellow đẹp không",
                    "Nike Shoe Model Yellow 40 màu Yellow"
                ]
            ],
            "responses": [
                "Có, giày Nike Shoe Model Yellow 40 màu Yellow là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Yellow 40 màu Yellow."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_yellow_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Nike Shoe Model Yellow 40 giá bao nhiêu",
                    "Nike Shoe Model Yellow 40 giá bao nhiêu",
                    "Nike Shoe Model Yellow 40 giá"
                ]
            ],
            "responses": [
                "Giày Nike Shoe Model Yellow 40 giá 1040000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Yellow 40 giá 1040000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_nike_shoe_model_black_41_không",
            "patterns": [
                [
                    "Bạn có Nike Shoe Model Black 41 không",
                    "có Nike Shoe Model Black 41 không",
                    "Nike Shoe Model Black 41 có không",
                    "Nike Shoe Model Black 41"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Nike Shoe Model Black 41 với màu Black và size 41."
            ],
            "context": [
                "Thông tin về Nike Shoe Model Black 41 với màu Black và size 41."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_black_41_màu_black_có_đẹp_không",
            "patterns": [
                [
                    "Giày Nike Shoe Model Black 41 màu Black có đẹp không",
                    "Nike Shoe Model Black 41 màu Black đẹp không",
                    "Nike Shoe Model Black 41 màu Black"
                ]
            ],
            "responses": [
                "Có, giày Nike Shoe Model Black 41 màu Black là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Black 41 màu Black."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_black_41_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Nike Shoe Model Black 41 giá bao nhiêu",
                    "Nike Shoe Model Black 41 giá bao nhiêu",
                    "Nike Shoe Model Black 41 giá"
                ]
            ],
            "responses": [
                "Giày Nike Shoe Model Black 41 giá 1200000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Black 41 giá 1200000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_nike_shoe_model_blue_41_không",
            "patterns": [
                [
                    "Bạn có Nike Shoe Model Blue 41 không",
                    "có Nike Shoe Model Blue 41 không",
                    "Nike Shoe Model Blue 41 có không",
                    "Nike Shoe Model Blue 41"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Nike Shoe Model Blue 41 với màu Blue và size 41."
            ],
            "context": [
                "Thông tin về Nike Shoe Model Blue 41 với màu Blue và size 41."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_blue_41_màu_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Nike Shoe Model Blue 41 màu Blue có đẹp không",
                    "Nike Shoe Model Blue 41 màu Blue đẹp không",
                    "Nike Shoe Model Blue 41 màu Blue"
                ]
            ],
            "responses": [
                "Có, giày Nike Shoe Model Blue 41 màu Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Blue 41 màu Blue."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_blue_41_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Nike Shoe Model Blue 41 giá bao nhiêu",
                    "Nike Shoe Model Blue 41 giá bao nhiêu",
                    "Nike Shoe Model Blue 41 giá"
                ]
            ],
            "responses": [
                "Giày Nike Shoe Model Blue 41 giá 1040000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Blue 41 giá 1040000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_nike_shoe_model_yellow_41_không",
            "patterns": [
                [
                    "Bạn có Nike Shoe Model Yellow 41 không",
                    "có Nike Shoe Model Yellow 41 không",
                    "Nike Shoe Model Yellow 41 có không",
                    "Nike Shoe Model Yellow 41"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Nike Shoe Model Yellow 41 với màu Yellow và size 41."
            ],
            "context": [
                "Thông tin về Nike Shoe Model Yellow 41 với màu Yellow và size 41."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_yellow_41_màu_yellow_có_đẹp_không",
            "patterns": [
                [
                    "Giày Nike Shoe Model Yellow 41 màu Yellow có đẹp không",
                    "Nike Shoe Model Yellow 41 màu Yellow đẹp không",
                    "Nike Shoe Model Yellow 41 màu Yellow"
                ]
            ],
            "responses": [
                "Có, giày Nike Shoe Model Yellow 41 màu Yellow là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Yellow 41 màu Yellow."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_yellow_41_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Nike Shoe Model Yellow 41 giá bao nhiêu",
                    "Nike Shoe Model Yellow 41 giá bao nhiêu",
                    "Nike Shoe Model Yellow 41 giá"
                ]
            ],
            "responses": [
                "Giày Nike Shoe Model Yellow 41 giá 1440000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Yellow 41 giá 1440000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_nike_shoe_model_blue_42_không",
            "patterns": [
                [
                    "Bạn có Nike Shoe Model Blue 42 không",
                    "có Nike Shoe Model Blue 42 không",
                    "Nike Shoe Model Blue 42 có không",
                    "Nike Shoe Model Blue 42"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Nike Shoe Model Blue 42 với màu Blue và size 42."
            ],
            "context": [
                "Thông tin về Nike Shoe Model Blue 42 với màu Blue và size 42."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_blue_42_màu_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Nike Shoe Model Blue 42 màu Blue có đẹp không",
                    "Nike Shoe Model Blue 42 màu Blue đẹp không",
                    "Nike Shoe Model Blue 42 màu Blue"
                ]
            ],
            "responses": [
                "Có, giày Nike Shoe Model Blue 42 màu Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Blue 42 màu Blue."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_blue_42_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Nike Shoe Model Blue 42 giá bao nhiêu",
                    "Nike Shoe Model Blue 42 giá bao nhiêu",
                    "Nike Shoe Model Blue 42 giá"
                ]
            ],
            "responses": [
                "Giày Nike Shoe Model Blue 42 giá 1440000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Blue 42 giá 1440000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_nike_shoe_model_light_blue_40_không",
            "patterns": [
                [
                    "Bạn có Nike Shoe Model Light Blue 40 không",
                    "có Nike Shoe Model Light Blue 40 không",
                    "Nike Shoe Model Light Blue 40 có không",
                    "Nike Shoe Model Light Blue 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Nike Shoe Model Light Blue 40 với màu Light Blue và size 40."
            ],
            "context": [
                "Thông tin về Nike Shoe Model Light Blue 40 với màu Light Blue và size 40."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_light_blue_40_màu_light_blue_có_đẹp_không",
            "patterns": [
                [
                    "Giày Nike Shoe Model Light Blue 40 màu Light Blue có đẹp không",
                    "Nike Shoe Model Light Blue 40 màu Light Blue đẹp không",
                    "Nike Shoe Model Light Blue 40 màu Light Blue"
                ]
            ],
            "responses": [
                "Có, giày Nike Shoe Model Light Blue 40 màu Light Blue là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Light Blue 40 màu Light Blue."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_light_blue_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Nike Shoe Model Light Blue 40 giá bao nhiêu",
                    "Nike Shoe Model Light Blue 40 giá bao nhiêu",
                    "Nike Shoe Model Light Blue 40 giá"
                ]
            ],
            "responses": [
                "Giày Nike Shoe Model Light Blue 40 giá 1040000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Light Blue 40 giá 1040000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_nike_shoe_model_yellow_42_không",
            "patterns": [
                [
                    "Bạn có Nike Shoe Model Yellow 42 không",
                    "có Nike Shoe Model Yellow 42 không",
                    "Nike Shoe Model Yellow 42 có không",
                    "Nike Shoe Model Yellow 42"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Nike Shoe Model Yellow 42 với màu Yellow và size 42."
            ],
            "context": [
                "Thông tin về Nike Shoe Model Yellow 42 với màu Yellow và size 42."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_yellow_42_màu_yellow_có_đẹp_không",
            "patterns": [
                [
                    "Giày Nike Shoe Model Yellow 42 màu Yellow có đẹp không",
                    "Nike Shoe Model Yellow 42 màu Yellow đẹp không",
                    "Nike Shoe Model Yellow 42 màu Yellow"
                ]
            ],
            "responses": [
                "Có, giày Nike Shoe Model Yellow 42 màu Yellow là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Yellow 42 màu Yellow."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_yellow_42_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Nike Shoe Model Yellow 42 giá bao nhiêu",
                    "Nike Shoe Model Yellow 42 giá bao nhiêu",
                    "Nike Shoe Model Yellow 42 giá"
                ]
            ],
            "responses": [
                "Giày Nike Shoe Model Yellow 42 giá 1600000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Yellow 42 giá 1600000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_nike_shoe_model_black_42_không",
            "patterns": [
                [
                    "Bạn có Nike Shoe Model Black 42 không",
                    "có Nike Shoe Model Black 42 không",
                    "Nike Shoe Model Black 42 có không",
                    "Nike Shoe Model Black 42"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Nike Shoe Model Black 42 với màu Black và size 42."
            ],
            "context": [
                "Thông tin về Nike Shoe Model Black 42 với màu Black và size 42."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_black_42_màu_black_có_đẹp_không",
            "patterns": [
                [
                    "Giày Nike Shoe Model Black 42 màu Black có đẹp không",
                    "Nike Shoe Model Black 42 màu Black đẹp không",
                    "Nike Shoe Model Black 42 màu Black"
                ]
            ],
            "responses": [
                "Có, giày Nike Shoe Model Black 42 màu Black là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Black 42 màu Black."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_black_42_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Nike Shoe Model Black 42 giá bao nhiêu",
                    "Nike Shoe Model Black 42 giá bao nhiêu",
                    "Nike Shoe Model Black 42 giá"
                ]
            ],
            "responses": [
                "Giày Nike Shoe Model Black 42 giá 1120000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Black 42 giá 1120000.0 VNĐ."
            ]
        },
        {
            "tag": "bạn_có_nike_shoe_model_black_40_không",
            "patterns": [
                [
                    "Bạn có Nike Shoe Model Black 40 không",
                    "có Nike Shoe Model Black 40 không",
                    "Nike Shoe Model Black 40 có không",
                    "Nike Shoe Model Black 40"
                ]
            ],
            "responses": [
                "Có, chúng tôi có Nike Shoe Model Black 40 với màu Black và size 40."
            ],
            "context": [
                "Thông tin về Nike Shoe Model Black 40 với màu Black và size 40."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_black_40_màu_black_có_đẹp_không",
            "patterns": [
                [
                    "Giày Nike Shoe Model Black 40 màu Black có đẹp không",
                    "Nike Shoe Model Black 40 màu Black đẹp không",
                    "Nike Shoe Model Black 40 màu Black"
                ]
            ],
            "responses": [
                "Có, giày Nike Shoe Model Black 40 màu Black là một trong những màu được ưa chuộng."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Black 40 màu Black."
            ]
        },
        {
            "tag": "giày_nike_shoe_model_black_40_giá_bao_nhiêu",
            "patterns": [
                [
                    "giày Nike Shoe Model Black 40 giá bao nhiêu",
                    "Nike Shoe Model Black 40 giá bao nhiêu",
                    "Nike Shoe Model Black 40 giá"
                ]
            ],
            "responses": [
                "Giày Nike Shoe Model Black 40 giá 1360000.0 VNĐ."
            ],
            "context": [
                "Thông tin về giày Nike Shoe Model Black 40 giá 1360000.0 VNĐ."
            ]
        }
    ]
}